#include <stdio.h>          //[평가항목8]다중소스파일사용
#include<string.h>               //strcmp함수 사용해주기위해

#define area 16 

// 함수 원형 정의
void menu(void);
void a(char* q);
void b(char* q);
void c(char* q);
void d();

struct contury {
	char c[20]; //나라이름
	int infecter;         //누적확진자
	char death_rate[20];           //사망률
};
void menu(void)
{
	printf("===========================================\n");
	printf("0. 코로나 지역별 누적확진자수\n");
	printf("1. 코로나 지역별 누적 사망자수\n");
	printf("2. 코로나 지역별 일일 확진자 현황\n");
	printf("3. 국가별 현황띄우기\n");
	printf("4. 종료\n");
	printf("===========================================\n");
}

void a(char* p)      //코로나 지역별 누적 확진자수
{
	int i, index;
	char w[area][2][100] = { {"경기","4.952.525"},
		 {"서울","3.638.248"},{"경북","784.540"}, {"경남","1.095.670"}, {"부산","1.098.582"}, {"대구","784.540"},
		 {"강원","520.091"}, {"울산","381.307"}, {"충남","717.883"},{"전남","598.087"}, {"전북","602.105"},
		 {"대전","513.785"},{"충북","557.513"}, {"광주","534.873"}, {"제주","236.983"},{"인천","1.076.815"} };
	index = 0;
	for (i = 0; i < area; i++)
	{
		if (strcmp(w[index][0], p) == 0)
		{
			printf("%s: %s명\n", p, w[index][1]);
			
		}
		index++;
	}
} //코로나 지역별 누적 사망자수
void b(char* p) {
	int i, index;
	char w[area][2][100] = { {"서울","4.853"},
		 {"경기","6.248"},{"경북","1.384"}, {"경남","1.253"}, {"부산","2.159"}, {"대구","1.339"},
		 {"강원","860"}, {"울산","341"}, {"충남","961"},{"전남","473"}, {"전북","877"},
		 {"대전","702"},{"충북","729"}, {"광주","561"}, {"제주","182"}, {"인천","1.398"} };
	index = 0;
	for (i = 0; i < area; i++)
	{
		if (strcmp(w[index][0], p) == 0)
		{
			printf("%s: %s명\n", p, w[index][1]);
			
		}
		index++;
	}
}

void c(char* p) {
	int i, index;
	char w[area][2][100] = { {"서울","7.308"},
		 {"경기","1.159"},{"경북","565"}, {"경남","436"}, {"부산","417"}, {"대구","391"},
		 {"강원","357"}, {"울산","294"}, {"충남","282"},{"전남","279"}, {"전북","264"},
		 {"대전","265"},{"충북","239"}, {"광주","188"}, {"제주","139"}, {"인천","263"} };
	index = 0;
	for (i = 0; i < area; i++)
	{
		if (strcmp(w[index][0], p) == 0)
		{
			printf("%s: %s명\n", p, w[index][1]);
			
		}
		index++;
	}
}
void d() {
	int i;
	struct contury list[9] = { {"미국",84706275,"%1.2"},{"한국",18225460,"0.1%"},
		{"중국",885897,"%0.6"},{"일본",9026281,"%0.3"},{"러시아",18104944,"%2.1"},{"프랑스",28917717,"%0.5"},
		{"영국",22459362,"%0.8"},{"인도",43222017,"%1.2"},{"호주",7614107,"%0.1"}
	};    //구조체 초기화 

	for (i = 0; i < 9; i++)
	{
		printf("%s 누적확진자 수:%d,사망률:%s\n", list[i].c, list[i].infecter, list[i].death_rate);

	}     
}