#define area 15

int a(char*p)      //코로나 지역별 확진자수
{
	char w[area][2][100] = { {"서울","1160"},
		 {"인천","278"},
		 {"경북","573"},
		 {"경남","440"},
		 {"부산","417"},
		 {"대구","396"},
		 {"강원","360"},
		 {"울산","297"},
		 {"충남","285"},
		 {"전남","279"},
		 {"전북","272"},
		 {"대전","268"},
		 {"충북","246"},
		 {"광주","192"},
		 {"제주","143"},
	};
	 


	return;
}

int b(char* p)     //코로나 지역별 사망자수
{
	return x - y;


	int c(int x, int y)    //
	{
		return x * y;
	}

	int d(int x, int y)
	{
		return x / y;
	}

